Repository: abdullah-az/adier
Catalog: frontend/lib/l10n/app_*.arb
Languages: ar

# appTitle
source: AI Video Editor
ar: محرر الفيديو بالذكاء الاصطناعي

# appTitleWithFlavor
source: AI Video Editor â€¢ {flavor}
ar: محرر الفيديو بالذكاء الاصطناعي • {flavor}

# navDashboard
source: Dashboard
ar: لوحة التحكم

# navWorkspace
source: Workspace
ar: مساحة العمل

# navSettings
source: Settings
ar: الإعدادات

# settingsHeading
source: Settings
ar: الإعدادات

# themeModeLabel
source: Theme mode
ar: وضع السمة

# themeModeSystem
source: System
ar: النظام

# themeModeLight
source: Light
ar: فاتح

# themeModeDark
source: Dark
ar: داكن

# languageLabel
source: Language
ar: اللغة

# languageEnglish
source: English
ar: الإنجليزية

# languageArabic
source: Arabic
ar: العربية

# diagnosticsTitle
source: Diagnostics
ar: التشخيص

# diagnosticsSubtitle
source: Flavor: {flavor} API base URL: {apiBaseUrl}
ar: البيئة: {flavor} عنوان واجهة برمجة التطبيقات: {apiBaseUrl}

# dashboardEnvironment
source: You're viewing the {flavor} environment.
ar: أنت تشاهد بيئة {flavor}.

# dashboardWelcome
source: Welcome to the AI Video Editor experience.
ar: مرحبًا بك في تجربة محرر الفيديو بالذكاء الاصطناعي.

# dashboardDescription
source: Use the navigation to explore upcoming product areas like automated clip curation, asset management, and analytics.
ar: استخدم التنقل لاستكشاف مجالات المنتج القادمة مثل اختيار المقاطع الآلي وإدارة الأصول والتحليلات.

# dashboardCardGenerationTitle
source: Clip Generation
ar: إنشاء المقاطع

# dashboardCardGenerationMessage
source: Configure AI models that segment long-form videos into shareable clips.
ar: قم بإعداد نماذج الذكاء الاصطناعي التي تقسم مقاطع الفيديو الطويلة إلى مقاطع قابلة للمشاركة.

# dashboardCardSchedulingTitle
source: Scheduling
ar: الجدولة

# dashboardCardSchedulingMessage
source: Plan publishing across platforms with smart scheduling suggestions.
ar: خطط للنشر عبر المنصات باستخدام اقتراحات جدولة ذكية.

# dashboardCardInsightsTitle
source: Insights
ar: الرؤى

# dashboardCardInsightsMessage
source: Track performance with metrics tailored to short-form video distribution.
ar: تتبع الأداء باستخدام مقاييس مصممة لتوزيع الفيديو القصير.

# workspaceTitle
source: Creator workspace
ar: مساحة العمل الإبداعية

# workspaceDescription
source: Build collaborative editing flows, manage media collections, and connect AI-driven automation pipelines.
ar: ابنِ تدفقات تحرير تعاونية، وأدر مجموعات الوسائط، واربط خطوط الأتمتة المعتمدة على الذكاء الاصطناعي.

# workspaceCreateButton
source: Create new workspace
ar: إنشاء مساحة عمل جديدة

# flavorDevelopment
source: Development
ar: التطوير

# flavorStaging
source: Staging
ar: التجريب

# flavorProduction
source: Production
ar: الإنتاج

# uploadProjectSectionTitle
source: Create a project
ar: إنشاء مشروع

# uploadProjectSectionSubtitle
source: Name your project to organise uploads and cross-platform distribution.
ar: قم بتسمية مشروعك لتنظيم عمليات الرفع والتوزيع عبر المنصات.

# uploadProjectNameLabel
source: Project name
ar: اسم المشروع

# uploadProjectNameHint
source: Summer campaign teaser
ar: مقطع الحملة الصيفية

# uploadProjectCreateButton
source: Create project
ar: إنشاء مشروع

# uploadProjectCreateAnotherButton
source: Start another project
ar: بدء مشروع آخر

# uploadProjectIdLabel
source: Project ID: {projectId}
ar: معرّف المشروع: {projectId}

# uploadProjectActiveLabel
source: Active
ar: نشط

# uploadFileSectionTitle
source: Upload a video
ar: رفع فيديو

# uploadFileSectionSubtitle
source: Add source footage via drag-and-drop or browse your device.
ar: أضف المادة المصدر بالسحب والإفلات أو بالاستعراض من جهازك.

# uploadFileDropInstructions
source: Drop your video file here
ar: قم بإسقاط ملف الفيديو هنا

# uploadFileTapInstructions
source: Tap to choose a video from your library
ar: اضغط لاختيار فيديو من مكتبتك

# uploadFileBrowseButton
source: Select video
ar: تحديد فيديو

# uploadFileUploadButton
source: Start upload
ar: بدء الرفع

# uploadFileOfflineRestriction
source: Reconnect to the internet to resume uploads.
ar: أعد الاتصال بالإنترنت لاستئناف عمليات الرفع.

# uploadFileGenericError
source: We couldn't prepare that file ({reason}).
ar: تعذّر تجهيز الملف ({reason}).

# uploadFileUnsupportedType
source: Only common video formats like MP4, MOV, or WEBM are supported.
ar: يتم دعم صيغ الفيديو الشائعة مثل MP4 وMOV وWEBM فقط.

# uploadFileSelectedLabel
source: {size} video selected
ar: تم اختيار فيديو بحجم {size}

# uploadFileRemoveButton
source: Remove file
ar: إزالة الملف

# uploadDashboardTitle
source: Upload dashboard
ar: لوحة رفع الملفات

# uploadDashboardSubtitle
source: Track ingest status across platforms in real time.
ar: تابع حالة الاستيراد عبر المنصات مباشرة.

# uploadDashboardEmptyStateTitle
source: No uploads yet
ar: لا توجد عمليات رفع بعد

# uploadDashboardEmptyStateSubtitle
source: Select a project and upload a video to see progress updates.
ar: اختر مشروعًا وارفع فيديو لعرض التقدم.

# uploadDashboardStatusUploading
source: Uploading
ar: جارٍ الرفع

# uploadDashboardStatusProcessing
source: Processing
ar: جارٍ المعالجة

# uploadDashboardStatusReady
source: Ready
ar: جاهز

# uploadDashboardStatusFailed
source: Failed
ar: فشل

# uploadDashboardStatusPending
source: Pending
ar: قيد الانتظار

# uploadDashboardRetryButton
source: Retry
ar: إعادة المحاولة

# uploadOfflineBannerMessage
source: You're offline. We'll hold uploads until the connection returns.
ar: أنت غير متصل. سنحتفظ بالعمليات حتى يعود الاتصال.

# uploadMessageProjectCreated
source: Project "{projectName}" is ready.
ar: المشروع "{projectName}" جاهز.

# uploadMessageProjectCreationFailed
source: We couldn't create the project: {reason}
ar: تعذّر إنشاء المشروع: {reason}

# uploadMessageInvalidProjectName
source: Enter a project name to continue.
ar: أدخل اسمًا للمشروع للمتابعة.

# uploadMessageOffline
source: Uploads are paused while you're offline.
ar: سيتم إيقاف الرفع مؤقتًا أثناء عدم الاتصال.

# uploadMessageUploadStarted
source: Uploading {fileName}...
ar: جارٍ رفع {fileName}...

# uploadMessageUploadCompleted
source: {fileName} finished processing.
ar: اكتملت معالجة {fileName}.

# uploadMessageUploadFailedNoReason
source: {fileName} failed to upload. Try again shortly.
ar: فشل رفع {fileName}. أعد المحاولة لاحقًا.

# uploadMessageUploadFailed
source: {fileName} failed to upload. {reason}
ar: فشل رفع {fileName}. {reason}
